result_not_consolidated/4core_4iothread/sysbench_1threads/c6620(emerald)_not_consolidated_4core_4iothread/delay_0/run5.txt
# run=5/5
# 2026-04-09T00:25:23-06:00

# cmd: taskset -c 5-55 ./bin/sysbench ./share/sysbench/oltp_read_write.lua
           --mysql-host=localhost
           --mysql-port=3306
           --mysql-user=sbuser
           --mysql-password=password
           --mysql-db=sbtest
           --tables=1
           --table_size=100
           --threads=1
           --time=60
           --rand-type=pareto
           --histogram=off
           run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            743470
        write:                           212420
        other:                           106210
        total:                           1062100
    transactions:                        53105  (885.06 per sec.)
    queries:                             1062100 (17701.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      885.0607
    time elapsed:                        60.0015s
    total number of events:              53105

Latency (ms):
         min:                                    0.66
         avg:                                    1.13
         max:                                    4.48
         95th percentile:                        1.18
         sum:                                59978.71

Threads fairness:
    events (avg/stddev):           53105.0000/0.00
    execution time (avg/stddev):   59.9787/0.00